{"type": "post", "title": "Mother of woman who died after Georgia’s six-week abortion ban calls for law’s repeal", "url": "https://www.wabe.org/mother-of-woman-who-died-after-georgias-six-week-abortion-ban-calls-for-laws-repeal/", "author": "msmoley", "time": "2025-03-17 17:40:31", "text": "", "comments": []}
{"type": "post", "title": "The USA Truly Is Now at Its Breaking Point & the Point of Imperilment of Its Federal Constitutional Bill of Rights Republic Form of Government Transitioning & Descending into a Rogue Presidential Dictatorship", "url": "https://www.reddit.com/r/MCDemocracy/comments/1jdijzk/the_usa_truly_is_now_at_its_breaking_point_the/", "author": "LordProphet", "time": "2025-03-17 17:35:57", "text": "**The USA Truly Is Now at Its Breaking Point & the Point of Imperilment of Its Federal Constitutional Bill of Rights Republic Form of Government Transitioning & Descending into a Rogue Presidential Dictatorship** ***(Mouse click on the following hyperlink to be factually informed as to why:***  [https://www.yahoo.com/news/us-deports-hundreds-venezuelans-despite-140611527.html?](https://www.yahoo.com/news/us-deports-hundreds-venezuelans-despite-140611527.html) ***)***\n\nAs of this action by POTUS Donald Trump, Trump has crossed the Rubicon and the United State of America is in a literal and formal state of US Constitutional crisis and breach of the US Constitution's demarcated separation of powers of the three branches of government, the congressional-legislative, the executive/administrative-presidential and the judicial-law adjudicating, applying and refereeing, with the executive-presidential branch blatantly defying and transgressing the US Constitutional authority of the federal judiciary -- there is more, applicably as regards the deconstruction and redirection of the US Constitutional and Congressionally legislated statutory-law agencies, property, public programs, budgets and staffing regulations of the federal civil service.  The MAGA insurrectionist event of January 6th of 2021, and the preparatory events of the weeks leading up to it, tell/s that he will go as far as he is allowed to go by the inaction and passivity of the US Congress, federal law enforcement and the armed forces in amassing and concentrating all federal government power in himself and for himself.  The USA is teetering at the edge of the precipice.  He goes as far as he can go.  The state governors and legislatures are the last government line of defense against a consolidated dictatorship in the USA.  Be prepared to be patriots and heroes.\n\nThe US Treasury money is the taxpayers' money and for the common good of the United States of America and the benefit and benefits of the population of the USA -- and not for a cryptocurrency bitcoin, etc., reserve -- and its appropriation and allocation are the US Constitutional responsibility and decision-making authority of the US Congress, and the Constitutional and Congressionally statutory institutional entities of the federal government, being civil service departments and agencies administered by the executive-presidential branch of the USA, can only be, as applicable, abolished or reconstituted by the US Congress.\n\nThe US Treasury, its money and the taxpayer money in general of the USA does not belong to the US president.  US Constitutionally, it is not for his or her discretionary, independent use but is entrusted for appropriation, allocation and disbursement control, and regulation and oversight, with the US Congress.  The US Congress, to whom the US president and executive branch of the federal government must seek funding as well as go for it to legislatively create a new department or agency of the executive branch of the federal government, levies taxes and allocates and regulates federal budgets and expenditures as well as conducts fiscal, efficiency and integrity audits of federal government operations via its audit agency the fearsome GAO, the \\[US\\] Government Accountability Office, the conceptual equivalent of an office of federal audit ferreting out waste, fraud and abuse, which makes redundant and \\[politically\\] purposefully questionable the indicatively unlawful Elon Musk-led Department of Government Efficiency.  \n\nThere is an obscure federal law that was enacted by the US Congress during the Bill Clinton Presidency, or during the presidency prior to or subsequent to it, allowing an officer or responsible employee of the executive branch of the federal government to be sued for violating any federal legal right of a citizen, or maybe even any member of the US population, in the course of performing his or her official duties, applicable to each participating and offending such person in the chain of action or command.  I conjecture that they can also be personally sued for financial repercussions by the courts therein and thereupon for violating court orders and engaging in egregious or specious official contempt of court.  \n\nThe White House spokeswoman stated publicly in effect, following violation of the court order, that the executive branch's disregard of the federal district judge's court order was not defiance, thus contempt of court, because the sole judge did not have the authority to make a court ruling or decision on the judicial issue before his court, a judicial decision-making opinion that US Constitutionally only a federal court of law can make, and not the US president, any officer or member of the executive branch or the US Congress.  This stance by the Trump Presidential Administration, if not legally confronted and jettisoned for the rubbish that is, would become the rationale and mantra of POTUS Trump or his Presidential Administration for defying any and all federal court rulings that POTUS Trump or his Presidential Administration might object to and not like.  Read the related news article below by mouse clicking on the following hyperlink:  [White House denies ignoring court order halting Venezuelan deportations to El Salvador | CNN Politics](https://www.cnn.com/2025/03/17/politics/trump-judge-court-order-venezuelan-deportations/index.html) .", "comments": []}
{"type": "post", "title": "Black Saturday: The Day the United States Ceased to Be a Constitutional Democracy", "url": "https://v.redd.it/1do3nn86w9pe1", "author": "transcendent167", "time": "2025-03-17 16:01:19", "text": "The Moment Democracy Ceased to Function\n\nSaturday, March 15, 2025, may have seemed unremarkable to most Americans. But in time, history will remember it as Black Saturday—the moment the United States ceased to function as a constitutional democracy.\n\nFor the first time in modern American history, a sitting president openly defied a direct federal court order—and nothing happened. No intervention. No enforcement. No consequences. A legal ruling was issued, and the White House simply ignored it.\n\nThe White House’s Decision: Power Over Law\n\nInside the White House, the decision was not about law—it was about power. A federal judge ruled against the administration. The debate inside Trump’s team was not whether the ruling was legal, but whether they could get away with ignoring it. They decided they could. And they were right.\n\nThis was not a clash between equal branches of government. It was the moment the judiciary was exposed as powerless. The courts do not have an army. They rely on compliance. But a court that cannot enforce its rulings is not a court—it is a suggestion box. And a presidency that can ignore the courts without consequence is no longer constrained by law—it is an untouchable executive.\n\nTrump did not declare the end of judicial authority in a speech. He demonstrated it in practice. This is how democratic systems collapse—not with a single act, but with the normalization of defiance, the expectation that a ruling can simply be brushed aside.\n\nHow the System Failed to Stop Him\n\nThis moment did not happen in isolation. It happened because every prior attempt to hold Trump accountable has failed. The system tried—and at every turn, it proved incapable of stopping him.\n\nImpeachment failed—twice. Criminal cases stalled. The Supreme Court refused to rule on his disqualification. Congress never moved to check his power. At each step, Trump tested the system—and the system flinched. He learned that laws are only as strong as the institutions willing to enforce them. And so, when faced with a court ruling, he did what he had been conditioned to do—he ignored it. And nothing happened.\n\nThe Supreme Court’s Role in Making the Presidency Untouchable\n\nThe judiciary was already weakened by years of erosion, but in 2024, the Supreme Court itself ensured that when this moment arrived, there would be no legal recourse left. In a landmark ruling, the Court expanded presidential immunity to such an extent that the office of the presidency is now functionally above the law. A president can commit crimes while in office and face no immediate accountability. And now, with Black Saturday, Trump has proven that he can ignore court rulings entirely without consequence.\n\nThis is not the separation of powers. It is the absorption of power into a single branch. The courts were supposed to be the last line of defense. Instead, they have been reduced to issuing rulings the executive can freely ignore.\n\nThe Role of Fox News in Conditioning the Public\n\nFox News did not issue the order, but it made this moment possible. In the aftermath of Trump’s defiance, Fox put the judge’s face on screen, not as part of neutral reporting, but as a deliberate act of intimidation. They did not need to explicitly declare that judicial rulings no longer mattered—they had already spent years training millions to believe it. Through relentless framing, they had conditioned their audience to see the courts as corrupt, as partisan, as obstacles to be overcome rather than institutions to be respected. Trump did not invent this strategy; he simply acted on it, carrying their rhetoric to its logical conclusion.\n\nWhy Americans Do Not See the Collapse Happening\n\nThis is why the phrase “you cannot see the forest for the trees” is so powerful in this moment. The trees are the individual events. Trump ignoring a court ruling. The Supreme Court making the presidency immune from criminal accountability. Congress failing to act repeatedly. The media normalizing the breakdown of democracy. The forest is the overarching reality. The U.S. government is no longer constrained by constitutional limits. The judiciary has been rendered powerless through precedent and selective enforcement. The executive branch now decides which laws apply to itself.\n\nMost people living through history don’t realize they are inside a moment of collapse because each event, taken alone, does not seem like the end of democracy. The shock of one ruling being ignored does not feel catastrophic. The Supreme Court deciding a president is immune from prosecution feels like just another legal controversy. Congressional inaction feels like business as usual. The media’s treatment of this moment as just another chapter in the ongoing Trump saga makes it easy to assume the system will self-correct. But when viewed together, it becomes undeniable that the system has already failed.\n\nThe Moment Future Historians Will Point To\n\nThis is why people will look back on Black Saturday and wonder why it wasn’t immediately recognized as the breaking point. Because when you are inside the collapse, it feels like just another day. The weight of history is often invisible in the moment, its consequences spread out over years. But the truth is unavoidable: this is not just another legal dispute. It is not another chapter in partisan warfare. It is not an escalation of existing dysfunction. It is the end of constitutional government.\n\nNo democracy that has reached this stage has ever recovered without major structural change. This is not just an escalation of political crisis—it is the moment when constitutional rule is replaced with raw executive power.\n\nWhy This Is Worse Than Any Previous Crisis\n\nThis is not like Andrew Jackson defying the Supreme Court in 1832. When Jackson ignored Worcester v. Georgia, America was an evolving democracy. The role of the Supreme Court was still in flux, and the country’s institutions were not yet fully formed. Today, America is a collapsing democracy. The Supreme Court’s authority is settled law. The difference is that this time, the institutions were expected to work.\n\nAndrew Jackson defied the Supreme Court in an era when executive power was not yet defined. Trump is erasing the limits on executive power in a system where they were already supposed to be settled. Jackson faced political opposition. Trump controls his party completely. In Jackson’s time, Congress still operated as a counterweight. Today, Congress is a rubber-stamp body that enables presidential overreach rather than restraining it.\n\nThe courts were supposed to be the final check. That check no longer exists.\n\nWhat Comes After Democracy?\n\nWe have passed the event horizon. This is not about democracy in crisis anymore—it is about what comes after democracy. The system that once absorbed and corrected these shocks is no longer functioning.\n\nThe shock of January 6th did not lead to democratic renewal—it was a preview of what was coming. The rollback of reproductive rights in 2022 was not just about abortion—it was proof that legal protections could be stripped away at will. The Supreme Court’s expansion of presidential power in 2024 did not just change legal precedent—it ensured that the next time a president defied a court order, there would be no enforcement mechanism to stop it. That is where we are now. The end of the courts as a meaningful check on power.\n\nThere is no going back to the America of the 1990s. No return to a time when presidential power was constrained, when the judiciary had the final say, when law enforcement agencies functioned as independent institutions rather than tools of political power. That system is already gone.\n\nSome will say this is alarmist. That democracy cannot end so quietly. But collapse does not feel like collapse when you are inside it. It feels like just another legal story. Just another Saturday in America. Until one day, you look up and realize there is nothing left to save.\n\nThe Final Verdict on Black Saturday\n\nBlack Saturday will be remembered as the day the constitutional system failed.\n\nSource:\n\nhttps://theintellectualist.com/black-saturday-us-constitutional-crisis-2025/", "comments": [{"type": "comment", "author": "AutoModerator", "time": "2025-03-17 16:02:03", "text": "##Join 50501 in Washington DC on April 5th!\n\n**Find more information:** https://seeyouinthestreets.com/\n\n**For all local events, continue to use:** https://events.pol-rev.com\n\n**For a full list of resources:** https://linktr.ee/fiftyfiftyonemovement\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/50501) if you have any questions or concerns.*", "url": "https://www.reddit.com/r/50501/comments/1jdg6d1/black_saturday_the_day_the_united_states_ceased/mia1eh1/"}, {"type": "comment", "author": "MilitantlyWokePatrio", "time": "2025-03-17 16:35:13", "text": "Yep, absolutely. But we are not done. We are making moves. This fight has now been fully revealed. It is across all levels of society, and particularly, in the information space. We have lost that space. The fact that random youtube videos covering this topic aren't flooded with comments calling it like it is, is the problem. In fact, it's where THEY have run their manipulation operations. The internet should be ablaze with \"TREASON' and so on. And if it were, we would have a population FAR MORE PRIMED for action than they are right now.\n\nBut this is NOT defeat. No as I've been thinking about this, this is an imminently solvable problem. I'm developing a game plan/org structure that I'm hoping to post soon, later today, for us to win the war on reality they are engaged in and crush the fascists in the information space. Remember, the whole story the whole time in Nazi Germany was that it was like the Germans are sleepwalking through it all. They didn't even know the war was going bad until a year out. Why? Because the disinformation was so prevalent.\n\nIf we win the information war, if we BREAK their echo chambers, or even introduce cracks (like allies dropping leaflets in Germany), we THEN are enabled to win the political and cultural war. We CANNOT hope that people will protest in the numbers we need without DOMINATING the information space, to the best that we can.\n\nI'll also release in that post the psyops that I see that their side is using to stop our mobilization efforts (in news videos on youtube and stuff), why it's potentially why we aren't seeing mass mobilizations (there's lots of fronts we fight, this is just one of them) so we can get a glimpse of JUST HOW SERIOUS they are taking this war on truth.\n\nMoves are being made. Stronger together, and keep the faith. AND ITS TIME TO FUCKING FIGHT.\n\nAmerica needs her warriors. An army of the willing. We will stand for her like others have before us.", "url": "https://www.reddit.com/r/50501/comments/1jdg6d1/black_saturday_the_day_the_united_states_ceased/mia89up/"}, {"type": "comment", "author": "MGSFFVII", "time": "2025-03-17 16:34:48", "text": "[Keep resisting](https://drive.proton.me/urls/WR9Z5F75FR#eErapmqe2tlZ). We knew he was going to do this sooner or later.", "url": "https://www.reddit.com/r/50501/comments/1jdg6d1/black_saturday_the_day_the_united_states_ceased/mia86qy/"}, {"type": "comment", "author": "amginetoile", "time": "2025-03-17 16:28:52", "text": "https://preview.redd.it/v4zjksk31ape1.jpeg?width=960&format=pjpg&auto=webp&s=a546ead9b1c7fbf691ae422a2d2fcee5990c6888", "url": "https://www.reddit.com/r/50501/comments/1jdg6d1/black_saturday_the_day_the_united_states_ceased/mia6yet/"}, {"type": "comment", "author": "Flashy-Reception647", "time": "2025-03-17 16:49:35", "text": "STOP POSTING AI VIDEOS OMFG", "url": "https://www.reddit.com/r/50501/comments/1jdg6d1/black_saturday_the_day_the_united_states_ceased/miab9zt/"}]}
{"type": "post", "title": "Weapon Uk laws", "url": "https://www.reddit.com/r/SWORDS/comments/1jdfplm/weapon_uk_laws/", "author": "Big-Inflation2758", "time": "2025-03-17 15:42:39", "text": "Hi everyone,\n\nI’m from Uk and I need to travel to Portugal for pagan festival and carry my scimitar with me.\nHowever the uk law regarding weapon are confusing. I contacted a weapon seller from USA and he says it’s impossible to pass through customs… some vendors says that is fine (presuming they just want to sell)\nI was thinking to send by post to Portugal and send from there back to uk just to avoid the customs.\n\nIs there anyone who could help me?\n", "comments": [{"type": "comment", "author": "DukeRedWulf", "time": "2025-03-17 15:55:13", "text": "If your question is about transporting an item you already own \\*in the UK\\*, why are you asking weapon \\*sellers\\* based in the USA? They are very unlikely to know UK law properly.\n\nIt'd help people respond to your query if you clarify some points:  \n\\- Do you already own your scimitar?  \n\\- Does your scimitar have a curved blade, and if so how long is that blade?.. (in cm, handle to tip)  \n\\- Is it an antique? Or a modern repro? If it's a repro, was it made using traditional techniques?  \n\\- Why do you \\*need\\* to take it to Portugal & back? i.e. What do you plan to do with it at this festival? \n\nNote: Posted packages also go through customs.", "url": "https://www.reddit.com/r/SWORDS/comments/1jdfplm/weapon_uk_laws/mi9zzdq/"}, {"type": "comment", "author": "Tobi-Wan79", "time": "2025-03-17 16:30:32", "text": "Likely the only solution is to go to Portugal buy the sword there, and then leave it there \n\nNot only are curved swords usually banned for both import and export, but even if you get one that is legal, the customs agent that finds it has to know enough about swords to tell that, now ask yourself how many of them you think is trained in sword identification....", "url": "https://www.reddit.com/r/SWORDS/comments/1jdfplm/weapon_uk_laws/mia7az1/"}, {"type": "comment", "author": "AOWGB", "time": "2025-03-17 16:21:38", "text": "I would suggest only buying a curved sword from a domestic source and I would not suggest trying to travel with it or try to post it back to the UK based on all that I’ve seen here.", "url": "https://www.reddit.com/r/SWORDS/comments/1jdfplm/weapon_uk_laws/mia5ftt/"}, {"type": "comment", "author": "Y_Dyn_Barfog", "time": "2025-03-17 16:55:25", "text": "Short answer. If it's not an antique, don't bother trying to get it into the UK.", "url": "https://www.reddit.com/r/SWORDS/comments/1jdfplm/weapon_uk_laws/miachzj/"}, {"type": "comment", "author": "Big-Inflation2758", "time": "2025-03-17 16:02:10", "text": "I didn’t buy my scimitar yet, I was planning to buy from USA because of the cheaper price and it is for a religious ceremony.\nI know swords with 100 years old are allowed, however these should be quite expensive.", "url": "https://www.reddit.com/r/SWORDS/comments/1jdfplm/weapon_uk_laws/mia1ff3/"}]}
{"type": "post", "title": "Grass Eaters 3 | 56", "url": "https://www.reddit.com/r/HFY/comments/1jdf6bk/grass_eaters_3_56/", "author": "Spooker0", "time": "2025-03-17 15:20:44", "text": "[Previous](https://www.reddit.com/r/HFY/comments/1jb8zk4/grass_eaters_3_55/)\n\n[First](https://www.reddit.com/r/HFY/comments/1gmn2xl/grass_eaters_3_01/) | [Series Index](https://www.reddit.com/r/hfy/wiki/series/grass_eaters) | [Website (for links)](https://readgrasseaters.com/)\n\n++++++++++++++++++++++++\n\n# 56 Fire Suppression II\n\n### Dominion Design Bureau Laboratory 382, Znos-8\n\n**POV: Irtisl, Znosian Dominion Navy (Rank: Five Whiskers)**\n\n**Fire detected in main server room. All personnel, immediately evacuate the facility by descending order of importance and rank. Fire detected in the main server room…**\n\nThe intercom blared out the urgent-sounding warning in a calm voice as Irtisl continued the struggle with her office door. The lock continued to refuse to budge.\n\n**Fire detected in main server room. Fire event in main server room approaching contingency threshold.**\n\nIrtisl had worked at the facility for eight years, and there were fire drills every hundred days. She knew exactly what the announcement meant. And despite the unfortunate events of today, she didn’t make it to Navy liaison with a Dominion-level Design Bureau lab by being a blubbering idiot.\n\nAbandoning her efforts to wrestle with her locked door, she took a quick glance at the glass observation window next to it, estimating its thickness and strength in her mind. It was built to allow her to look into the server room, not to keep out intruders. At least, that was what she hoped as she wrapped her paws around her office stool. \n\n“Arrrrghhhhh!” she screamed with effort. With a single heft, with strength she did not know she had, she hurled the stool at the glass, legs first.\n\n*Crash.*\n\nThe sharp bottom prongs of her chair went straight through the window, piercing it. The safety glass didn’t shatter, merely cracked into spiderwebs, but the breach in its integrity forced it out of its flimsy frame. With another grunt, Irtisl pulled the chair out, the entire panel of safety glass coming out with its legs.\n\n“Yes!”\n\nThe opening wasn’t big, but it was big enough to squeeze through. Without hesitation, she tossed the chair aside and hopped right through the opening, making her way for the server room exit without breaking pace. \n\nIt wasn’t far, only about twenty or so meters from her office. She hopped at it with the top speed of a sedentary office worker, reaching it in just two seconds. Her paws slammed against the open lever.\n\nLocked. Again.\n\n“Oh, of course!” she exclaimed angrily, giving the lever another angry shove. The sturdy, steel door ignored her.\n\nThe sign above the door mocked her with its contents, written in big, bold letters. \n\nWHEN ALARM SOUNDS,\n\nYOUR LIFE WAS FORFEITED.\n\nAs if in response to her third fruitless slam against the door lever, the siren over the intercom stopped abruptly. The calm intercom voice announced:\n\n**Main server room temperature threshold exceeded. Fire suppression contingency in progress.**\n\n*Hisssssss.*\n\nIrtisl instinctively looked up towards the source of the sound in the ceiling vents. She couldn’t detect anything coming out of there.\n\nBecause… of course not. \n\n*To extinguish a fire without damaging the equipment, carbon dioxide is released to flood the room. Carbon dioxide is a colorless, odorless gas,* she recalled from her safety training. *The only way to stop a release in progress is…*\n\nFinally remembering that obscure piece of trivia in her distant memory, Irtisl hopped at the emergency gas release cut-off valve in the back of the server room. It wasn’t ever supposed to be used to save lives, as mere lives were generally far less valuable to the Dominion than the expensive equipment in this room. But Irtisl was cognizant enough for her subconscious to realize that what she had in her head was now far more important than whatever research data was contained on these servers.\n\nPlus, there was no actual fire in the room. \n\nHer mind had realized that about ten seconds ago, but it wasn’t the most important thing on it at the moment.\n\nHolding her breath to protect her lungs from the releasing gas, Irtisl reached the gas cut-off. She pulled the abort lever as hard as she could.\n\n*Hisssssssss.*\n\nThe vents continued to hiss. She pulled the lever again.\n\n*Hisssssssss.*\n\nIrtisl examined down at the gas cut-off line, tracing it to… an exposed wire dangling uselessly from it.\n\nShe was not a particularly creative or critical-thinking individual for someone in her position, but Irtisl could add two and two. The apostates, the fake voice on the line, the locked doors, the false fire alarm, and now this.\n\nSabotage. Predator sabotage. She no longer had any doubts in her mind.\n\nAs her lungs gasped for air, Irtisl’s thoughts strayed to her bloodline. If she did one last thing right, perhaps there could still be redemption for them. Perhaps, even in her dying moments, she could still be of Service to her Dominion. Her mind made up, she hopped back through the hole she made earlier in her office window, using up the last bit of untainted oxygen left in her lungs.\n\n*Hisssssssssss.*\n\nHer lungs burnt, crying out for relief every breath; they expected oxygen and found nothing. Reaching her datapad, her vision blurred slightly as the lighter breathable air in the room was crowded out by the heavier non-flammable gas. But she was a lifelong office worker. She didn’t need perfect vision to type.\n\nPREDATOR SABOTAGE, she jabbed onto the text program on her datapad even as she leaned against her office table in weakness. \n\nCONTACT STATE SECURITY. HIGHEST PRIORITY.\n\nDOMINION HATCHLING POOLS SABOTAGED.\n\nWith her dying words recorded and thus her final mission accomplished, that last bit of her strength and willpower left her. The growing haze in her mind squeezed out her ability to think, and her eyelids fluttered in exhaustion. Irtisl allowed her datapad to fall out of her loose grasp and clatter onto her office’s smooth, concrete floor.\n\n*Hisssssss.*\n\nAs her vision dimmed, Irtisl had just enough energy left in her to frown as she watched the words she typed onto the datapad screen erase themselves, one-by-one.\n\n“Huh?” she grunted in half-pain and half-confusion. She tried to pick the datapad up again, to do… something. But she no longer had the strength.\n\nThe words on her screen had wiped themselves, replaced by two simple lines of text, five words in large, high-contrast font:\n\n*NICE TRY, BUN.*\n\n*NIGHT NIGHT.*\n\nThen, the taunt erased itself too.\n\nLaying face-up on the floor half a meter away, her entirely blank datapad screen was the last thing Irtisl saw before she passed out forever.\n\n++++++++++++++++++++++++\n\n### Republic Senate Complex, Luna\n\n**POV: Amelia Waters, Terran Republic Navy (Rank: Fleet Admiral)**\n\nAmelia idly wondered how much of her and her fellow taxpayers’ hard-earned money were going to the fancy main holographic display currently active on the floor of the Navy Oversight Committee. Millions of credits, possibly.\n\nThe expensive high resolution lightshow managed to perfectly convey the distress of the figure on the screen.\n\n“I am an orchard farmer,” the character was saying as she sobbed. She was a Znosian — by her estimate, about one or two years old — crying over the loss of her hydroponic fruit farm to an orbital strike. Unfortunately, her fruit farm was located a block away from a newly built heavy munitions plant deemed a high priority target by the targeting intelligences of the Republic Navy, a building that was — interestingly — kept just out of view of the video’s framing. “Just an orchard farmer!”\n\n“Look! Look what they did!” She gestured out behind her animatedly, and the camera panned to a scene of ruined concrete and broken glass behind her. “Look what they did to my garden! It was my responsibility!”\n\nA voice came from offscreen, its speaker unseen. “Farmer Siskashom, you have to leave. They’re going to hit it again. The evacuation order—”\n\n“I’m not leaving! This is my orchard! I will rebuild!”\n\n“You have to leave now! They just issued another warning! There is a second strike coming in twenty minutes. Come with us. You will be assigned a replacement assignment as soon as—”\n\n“No! I’m not leaving! Go away! I would rather rejoin the Prophecy than leave my responsibility!”\n\n“Come on, farmer. The directives are clear. Inefficiency is not permitted. You’re coming with us, one way or another.”\n\nThere was a quick and chaotic scuffle on screen as a figure hopped into the camera angle, grabbing at Farmer Siskashom.\n\n“No! Yaaaaargh!”\n\n“Ow! What the— She bit me! Get back here! You can’t—”\n\nThe farmer hopped off in another direction away from the video. “You can’t make me! You can’t make me leave! I’m not leaving! I’m not leaving!”\n\n“You defective idiot—”\n\n“Eh. Leave her, attendant.”\n\n“But—”\n\n“We’ve got a few hundred more people to evacuate today. Her life was forfeited the day she left the hatchling pools.”\n\nThe video went to black, and the dimmed lights in the chamber came back to full brightness. There was a long silence on the dais as the Senators fully digested the video and its implications.\n\nSenator Seimur Eisson was the first to break the silence. He stared down the dais at Amelia. “I don’t see a fucking problem.”\n\nOne of the other Senators sighed. Several of the others rolled their eyes, and some refused to look his way.\n\n*Huh. Interesting.*\n\nSeimur didn’t budge. He looked around at his fellow Senators. “What? I don’t see the problem. They started this war, and the idiot said she’d rather die. That’s on her. Admiral, how many more of these are we showing today?”\n\nAmelia cleared her throat lightly as she checked her notes. “That was the last one. They’re all roughly the same. There’s a few hundred of these videos we intercepted. We think they did manage to get these out of the system.”\n\nSenator Blake Wald cut in before Seimur could. “Is there a chance that these propaganda videos are… I don’t know… staged or fake?”\n\n“Some of them are,” Amelia said, nodding. “There are a few videos like that, where we’ve confirmed the identities of some of the participants being not what they said they were, and there are a few videos that were obviously made off-planet. And worse, there are a few falsely attributing the results of their own sabotage operations to us; in one particularly egregious incident, they blamed us for a massacre carried out by their local State Security governor. A vast majority of these videos, however, do appear to be genuine. Unfortunately.”\n\n“But I thought we allowed them enough time to evacuate everyone they needed to!” Senator Wald said in exasperation.\n\n“We did. From what we could tell, they got everyone they could. We intercepted transmissions from their officials saying they’re done, and then we waited for those people to get out of the blast zones. But it’s a chaotic war, and we don’t have people on the ground checking their work. Some people fall through the cracks. The strikes were good, but with that many targets… we estimate up to a thousand people were left behind on this planet alone. There is… a particularly gruesome video of a circle of Znosians praying as they burned to death inside a fuel storage depot they refused to evacuate.”\n\nSeimur shrugged and cut in again. “So? Sounds a lot like their problem to me. I can’t believe we’re even entertaining these. My God, these people are almost as whiny as the Red Zoners! This is clearly just an attempt to get us to agree to not do to them exactly what they planned to do to all of us! If you ask me, the real problem was that we let any of them get away to begin with!”\n\n“It is not my job to tell you how to feel about these, nor what the policy of the Republic should be,” Amelia said carefully. “But… if my guess about how they plan to use this is right, I have a feeling the citizens of the Republic won’t all share your views.”\n\n“You’re talking about the tiny mob of idiots protesting about the war outside?” Seimur asked sarcastically. “Those people are here every week, Admiral. It’s Atlas; if they’re not going to complain about this, they’re going to complain about something else just as dumb. Let me tell you, we know how to deal with *those* kinds of people in my district.”\n\nAmelia had no doubt he was telling the truth. Senator Seimur Eisson’s district was recently in the news for the lynching of an innocent former Saturnian dock worker… and the subsequent botched mistrial for the perpetrators before the case had to be moved to a Republic court in Olympus. They weren’t very big on the rule of law in the northern Martian plains these days.\n\n*What does it say about me that I agree with him on this?*\n\n“Enough, Senator Eisson,” Blake said. He turned to Amelia. “What’s the Navy’s plan to deal with this?”\n\n“We’re going to continue doing what we’re doing. Our legal intelligences vetted every strike, and independent auditors reviewed their decision-making after the fact. Everything was done above-board and based on what we could have reasonably known at the time we launched it. That is all we can do. But this is a warning for you: the Buns know what they’re doing here. They’re making these videos to get their people to fight to the death. That it also stirs up sympathy for them amongst some of our people is a side benefit to them.”\n\nBlake thought for a moment. “Understood, Fleet Admiral. I actually don’t totally disagree with Senator Eisson here—”\n\n“Thank you!”\n\n“Not entirely, at least. Most Republic citizens knew this was going to be a long, brutal war. We haven’t yet forgotten about the Battle of Sol. And even if it is fought so far away that they don’t feel it intuitively, most people understand that this is an existential war without comparison in the history of our Republic. And the Navy will continue to have — pardon the expression — a long leash to conduct this war as it sees fit. Just be aware that a long leash is still ultimately a leash.”\n\nAmelia nodded. “Yes, Senator. I understand.”\n\n“That said, we’ve uh— we’ve considered their truce proposal from last time.”\n\n“Senator?”\n\n“It is— parts of it are acceptable to us on principle. We will likely recommend it for a full vote in the Senate as soon as we review all the details.”\n\nShe consciously stopped her eyes from narrowing in skepticism. “Which… parts are acceptable?”\n\n“We are not keen on a ceasefire, but rather, we want our allies’ worlds back under our control as soon as possible. It’s tens of billions of our allies’ people. If agreeing to an armistice is the only way to free them, then it needs to be fully considered. The conditions need to be worked through, but there is… the start of something we can possibly agree to here.”\n\n“A truce? How long would we allow them to rebuild their fleets to come attack us with?”\n\n“That will be up to you, Admiral. As you told their director, we are in no hurry to stop shooting at them, and every additional piece of damage we inflict on them drives up the leverage we have in eventual negotiations. So it depends on the outcome of the next phase of your— our campaign. But from now on, it would be wise to… orient the operations planning with that potential future constraint in mind.”\n\n++++++++++++++++++++++++\n\n### Spaceport Sugihara, McMurdo System (25,000 Ls)\n\n**POV: Monvu, Malgeir (Civilian)**\n\nMonvu woke to the changing pitch of the ship’s inertial compensators. Despite his sensitive Malgeir ears, he was not one of those experienced spacers who claimed to be able to accurately determine the changing acceleration of a ship by the subtle shifts in the ambient noise they put out. In fact, this trip was the first time he’d travelled interstellar. But his two-month journey from recently-liberated Plorve had taught him that this meant they were now accelerating the other way.\n\nHe flexed and massaged his numb paws and looked around him. The flight was way over capacity. Just over four hundred Malgier were crammed into a small passenger liner designed to hold a third that. Its originally spacious seats had been stripped out, replaced with clans of war refugees huddled sitting on the worn carpeted floor. Entire cub litters were clutched in their dame’s paws, some constantly whimpering in discomfort. Monvu saw a few younger ones — not old enough to be conscripted into the meatgrinder at the front, but not young enough for passerbys to ask them where their sires and dames were — they leaned against the walls and their suitcases, trying to catch some sleep in the cacophony.\n\nHis stomach grumbled. It had been four days since they’d been fed. The chartered journey promised a destination, not inflight meals. He’d used the last of his meager credits splitting a small bag of Terran jerky with a young female passenger originally from Gruccud. Monvu let her have most of the bag; she looked like she needed it more than he did. \n\nBefore the war started, Monvu was a mathematician; he worked for the Federation government, calculating the monetary worth of dens in his district for the purposes of taxation and census. \n\nAfter, he was a survivor. \n\nPlorve was only under Znosian occupation for just over a year. The medium sized colony on Plorve-3, boasting 1.5 billion residents, was not considered an immediate priority for the occupiers. And it was close enough to the front that they were wary of investing too many resources to its full extermination. Plus, the Znosians needed some of the Malgeir there to operate their existing infrastructure to maintain their supply lines; by all accounts, the Federation Navy left in a hurry and left those in a perfectly serviceable state for the enemy when they blinked in and took over the system without much of a fight. Compared to the outlying planets like Gruccud, or worse, the Granti systems, Plorve was lucky.\n\nMonvu *only* lost everyone in his immediate clan, all but two of his extended clan, and all but one friend and one annoying coworker.\n\nThere was nothing left for him there. After the fleets came in to liberate the place, he got out. He used all the government connections he had left to get on one of the overcrowded flights to the Federation core systems. From there, he hopped from system to system using his dwindling funds until he found himself on a flight for war refugees headed out of Malgeir territory, to the space of the new alien species that had helped save his people.\n\nThough they knew little about the Terrans, and perhaps because of that, he knew there was something strange in the air. Something new.\n\nAs Monvu looked at the miserable conditions around him, he did not sense the fear he’d become used to. He saw something else: hope. Hope that tomorrow would be better than today. Hope that they weren’t all dreaming a bad dream. Hope that the Channel One newscaster wasn’t lying when he said that the Terrans offered safety for some, purpose for others, and belonging for all.\n\nIt really was too bad he was there to ruin it for them all.\n\n++++++++++++++++++++++++\n\n[Buy my book!](https://www.amazon.com/dp/B0DYGKVK15)\n\n++++++++++++++++++++++++\n\n[Previous](https://www.reddit.com/r/HFY/comments/1jb8zk4/grass_eaters_3_55/)", "comments": [{"type": "comment", "author": "ErinRF", "time": "2025-03-17 15:38:20", "text": "Oh now this is ominous…", "url": "https://www.reddit.com/r/HFY/comments/1jdf6bk/grass_eaters_3_56/mi9wiry/"}, {"type": "comment", "author": "Caddmus", "time": "2025-03-17 15:44:54", "text": "DUN DUN DUUUUuuuunnnnnnnnnnnnnn!", "url": "https://www.reddit.com/r/HFY/comments/1jdf6bk/grass_eaters_3_56/mi9xula/"}, {"type": "comment", "author": "cometssaywhoosh", "time": "2025-03-17 16:45:02", "text": "Traitors among the Malgeir. This is going to be interesting. \n\nTerrans going to have a hell of a time fighting both the Buns and Malgeir turncoats. Especially when they can't trust their own allies now (who among them will be a turncoat?).", "url": "https://www.reddit.com/r/HFY/comments/1jdf6bk/grass_eaters_3_56/miaabs8/"}, {"type": "comment", "author": "UpdateMeBot", "time": "2025-03-17 15:21:04", "text": "[Click here](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Subscribe&message=SubscribeMe%20u%2FSpooker0%20r%2FHFY) to subscribe to u/Spooker0 and receive a message every time they post.\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/UpdateMeBot/comments/ggotgx/updatemebot_info_v20/)|[^(Request Update)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=Update&message=SubscribeMe%21%20u%2Fusername%20r%2Fsubreddit)|[^(Your Updates)](https://www.reddit.com/message/compose/?to=UpdateMeBot&subject=List%20Of%20Updates&message=MyUpdates)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=UpdateMeBot%20Feedback)|\n|-|-|-|-|", "url": "https://www.reddit.com/r/HFY/comments/1jdf6bk/grass_eaters_3_56/mi9t2uk/"}, {"type": "comment", "author": "HFYWaffle", "time": "2025-03-17 15:21:04", "text": "/u/Spooker0 ([wiki](https://www.reddit.com/r/HFY/wiki/authors/Spooker0)) has posted 130 other stories, including: \n\n \n* [Grass Eaters 3 | 55](https://www.reddit.com/r/HFY/comments/1jb8zk4/grass_eaters_3_55/)\n* [Grass Eaters 3 | 54](https://www.reddit.com/r/HFY/comments/1j9ragn/grass_eaters_3_54/)\n* [Grass Eaters 3 | 53](https://www.reddit.com/r/HFY/comments/1j7zuzs/grass_eaters_3_53/)\n* [Grass Eaters 3 | 52](https://www.reddit.com/r/HFY/comments/1j5q5ws/grass_eaters_3_52/)\n* [Grass Eaters 3 | 51](https://www.reddit.com/r/HFY/comments/1j47713/grass_eaters_3_51/)\n* [Grass Eaters 3 | 50](https://www.reddit.com/r/HFY/comments/1j2psno/grass_eaters_3_50/)\n* [Grass Eaters 3 | 49](https://www.reddit.com/r/HFY/comments/1j0djn1/grass_eaters_3_49/)\n* [Grass Eaters 3 | 48](https://www.reddit.com/r/HFY/comments/1iys1uz/grass_eaters_3_48/)\n* [Grass Eaters 3 | 47](https://www.reddit.com/r/HFY/comments/1ix4ko1/grass_eaters_3_47/)\n* [March of Progress](https://www.reddit.com/r/HFY/comments/1ix4k78/march_of_progress/)\n* [Grass Eaters 3 | 46](https://www.reddit.com/r/HFY/comments/1iuskfh/grass_eaters_3_46/)\n* [Grass Eaters 3 | 45](https://www.reddit.com/r/HFY/comments/1iti2sq/grass_eaters_3_45/)\n* [Grass Eaters 3 | 44](https://www.reddit.com/r/HFY/comments/1irpcvg/grass_eaters_3_44/)\n* [Grass Eaters 3 | 43](https://www.reddit.com/r/HFY/comments/1ipirfi/grass_eaters_3_43/)\n* [Grass Eaters 3 | 42](https://www.reddit.com/r/HFY/comments/1inz5eo/grass_eaters_3_42/)\n* [Grass Eaters 3 | 41](https://www.reddit.com/r/HFY/comments/1imdto7/grass_eaters_3_41/)\n* [Grass Eaters 3 | 40](https://www.reddit.com/r/HFY/comments/1ik15sx/grass_eaters_3_40/)\n* [Grass Eaters 3 | 39](https://www.reddit.com/r/HFY/comments/1iig43u/grass_eaters_3_39/)\n* [Grass Eaters 3 | 38](https://www.reddit.com/r/HFY/comments/1igvbb1/grass_eaters_3_38/)\n* [Grass Eaters 3 | 37](https://www.reddit.com/r/HFY/comments/1iek4gu/grass_eaters_3_37/) \n\nThis comment was automatically generated by `Waffle v.4.7.8 'Biscotti'`. \n\n[Message the mods](https://www.reddit.com/message/compose?to=%2Fr%2FHFY&subject=WaffleBot|1jdf6bk&message=If%20you%20have%20problems%20with%20updatemebot,%20contact%20Watchful1.%20We%20do%20not%20maintain%20it.) if you have any issues with Waffle.", "url": "https://www.reddit.com/r/HFY/comments/1jdf6bk/grass_eaters_3_56/mi9t2vc/"}]}
